{
    "eightKs": [
        {
            "content": "Entry into a Material Definitive Agreement The information set forth under Item 5.02 is incorporated by reference herein. Item 5.02Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Effective December 30, 2020, P & F Industries, Inc. (the “Company”) and Joseph A. Molino, Jr., the Company’s Vice President, Chief Operating Officer and Chief Financial Officer, entered into Amendment No. 2 (“Amendment No. 2”) to Executive Employment Agreement, dated as of January 1, 2018, as amended (the “Employment Agreement”). Amendment No. 2 amends the expiration date of the Employment Agreement from December 31, 2020 to December 31, 2023. The foregoing description of Amendment No. 2 does not purport to be complete and is qualified in its entirety by reference to the full text of Amendment No. 2 filed as Exhibit 10.1 to this Current Report on Form 8-K which is incorporated by reference herein.  ",
            "date": "2021-01-04",
            "details": "",
            "filingType": "8-K",
            "link": "https://www.sec.gov//Archives/edgar/data/75340/000110465921000253/tm2039547d1_8k.htm",
            "nonComplianceType": "",
            "nonCompliant": false,
            "tags": []
        },
        {
            "content": "Results of Operations and Financial Condition. On May 18, 2020, P & F Industries, Inc. (the “Company”) issued a press release (the “Press Release”) announcing its financial results for the quarter ended March 31, 2020. A copy of the Press Release is furnished as Exhibit 99.1 hereto, and is incorporated herein by reference. The information in the Press Release is being furnished, not filed, pursuant to this Item 2.02. Accordingly, the information in the Press Release will not be incorporated by reference into any registration statement filed by the Company under the Securities Act of 1933, as amended, unless specifically identified therein as being incorporated therein by reference. The furnishing of the information in this Report is not intended to, and does not, constitute a determination or admission by the Company that the information in this Report is material or complete, or that investors should consider this information before making an investment decision with respect t",
            "date": "2020-05-18",
            "details": "",
            "filingType": "8-K",
            "link": "https://www.sec.gov//Archives/edgar/data/75340/000110465920063021/tm2020007d1_8k.htm",
            "nonComplianceType": "",
            "nonCompliant": false,
            "tags": []
        },
        {
            "content": "Results of Operations and Financial Condition. On August 11, 2020, P & F Industries, Inc. (the “Company”) issued a press release (the “Press Release”) announcing its financial results for the quarter ended June 30, 2020. A copy of the Press Release is furnished as Exhibit 99.1 hereto, and is incorporated herein by reference. The information in the Press Release is being furnished, not filed, pursuant to this Item 2.02. Accordingly, the information in the Press Release will not be incorporated by reference into any registration statement filed by the Company under the Securities Act of 1933, as amended, unless specifically identified therein as being incorporated therein by reference. The furnishing of the information in this Report is not intended to, and does not, constitute a determination or admission by the Company that the information in this Report is material or complete, or that investors should consider this information before making an investment decision with respect",
            "date": "2020-08-11",
            "details": "",
            "filingType": "8-K",
            "link": "https://www.sec.gov//Archives/edgar/data/75340/000110465920093092/tm2027192-1_8k.htm",
            "nonComplianceType": "",
            "nonCompliant": false,
            "tags": []
        },
        {
            "content": "Entry into a Material Definitive Agreement On August 17, 2020, the Company, its subsidiaries Florida Pneumatic Manufacturing Corporation (“Florida Pneumatic”) and Hy-Tech (together with the Company and Florida Pneumatic, collectively, “Borrowers”) and the Registrant’s subsidiaries Jiffy Air Tool, Inc. (“Jiffy”), ATSCO Holdings Corp. (“ATSCO”), Bonanza Properties Corp. (“Properties”), Continental Tool Group, Inc. (“Continental Tool”), Countrywide Hardware, Inc. (“Countrywide”), Embassy Industries, Inc. (“Embassy”), Exhaust Technologies, Inc. (“Exhaust”) and Hy-Tech Illinois, Inc. (formerly known as DaVinci Purchase Corp., and together with Jiffy, ATSCO, Properties, Continental Tool, Countrywide, Embassy and Exhaust, collectively, “Guarantors”) entered into a Second Modification Regarding Payroll Protection Program Consent (the “Modification Letter”) with Capital One, National Association, as agent (the “Agent”) for the lenders (the “Le",
            "date": "2020-08-21",
            "details": "",
            "filingType": "8-K",
            "link": "https://www.sec.gov//Archives/edgar/data/75340/000110465920097444/tm2029118d1_8k.htm",
            "nonComplianceType": "",
            "nonCompliant": false,
            "tags": []
        },
        {
            "content": "Submission of Matters to a Vote of Security Holders On May 20, 2020, P&F Industries, Inc. (the “Registrant”) held its 2020 Annual Meeting of Stockholders (the “Annual Meeting”). At the Annual Meeting, the stockholders (i) elected two (2) directors, each to a term that expires at the 2023 annual meeting of stockholders and until their successors are elected and qualified, (ii) ratified the appointment of CohnReznick LLP as the Registrant’s independent registered public accounting firm for the year 2020 and (iii) approved an advisory (non-binding) resolution regarding the compensation of the Registrant’s named executive officers. Set forth below are the final voting results for each of the proposals: 1.Election of directors:  Name of Nominee Votes For Votes Withheld Broker Non-Votes   Kenneth M. Scheriff 1,946,781 537,929 435,023   Mitchell A. Solomon 1,952,182 532,528 435,023  2.Proposal to ratify the appointment of CohnReznick LLP as the Registrant’s independent registere",
            "date": "2020-05-26",
            "details": "",
            "filingType": "8-K",
            "link": "https://www.sec.gov//Archives/edgar/data/75340/000110465920065748/tm2020785d1_8k.htm",
            "nonComplianceType": "",
            "nonCompliant": false,
            "tags": []
        },
        {
            "content": "Results of Operations and Financial Condition.  On November 12, 2020, P & F Industries, Inc. (the “Company”) issued a press release (the “Press Release”) announcing its financial results for the quarter ended September 30, 2020. A copy of the Press Release is furnished as Exhibit 99.1 hereto, and is incorporated herein by reference.  The information in the Press Release is being furnished, not filed, pursuant to this Item 2.02. Accordingly, the information in the Press Release will not be incorporated by reference into any registration statement filed by the Company under the Securities Act of 1933, as amended, unless specifically identified therein as being incorporated therein by reference. The furnishing of the information in this Report is not intended to, and does not, constitute a determination or admission by the Company that the information in this Report is material or complete, or that investors should consider this information before making an investment decision wit",
            "date": "2020-11-12",
            "details": "",
            "filingType": "8-K",
            "link": "https://www.sec.gov//Archives/edgar/data/75340/000110465920124129/tm2035755d1_8k.htm",
            "nonComplianceType": "",
            "nonCompliant": false,
            "tags": []
        },
        {
            "content": "Results of Operations and Financial Condition.  On March 25, 2021, P & F Industries, Inc. (the “Company”) issued a press release (the “Press Release”) announcing its financial results for the year ended December 31, 2020. A copy of the Press Release is furnished as Exhibit 99.1 hereto, and is incorporated herein by reference. The information in the Press Release is being furnished, not filed, pursuant to this Item 2.02. Accordingly, the information in the Press Release will not be incorporated by reference into any registration statement filed by the Company under the Securities Act of 1933, as amended, unless specifically identified therein as being incorporated therein by reference. The furnishing of the information in this Report is not intended to, and does not, constitute a determination or admission by the Company that the information in this Report is material or complete, or that investors should consider this information before making an investment decision with respec",
            "date": "2021-03-25",
            "details": "",
            "filingType": "8-K",
            "link": "https://www.sec.gov//Archives/edgar/data/75340/000110465921041300/tm2110901d1_8k.htm",
            "nonComplianceType": "",
            "nonCompliant": false,
            "tags": []
        }
    ],
    "importantItems": [],
    "na": false,
    "ownership": {
        "calculatedFloat": 0,
        "date": "",
        "footnotes": null,
        "rows": null,
        "sharesOutstanding": 0,
        "source": "",
        "sourceType": "",
        "sumActual": 0,
        "textbookFloat": 0
    },
    "shelfs": null,
    "stockInfo": {
        "exchange": "NASDAQ",
        "float": "1.45M",
        "income": "-4.90M",
        "io": "3.60%",
        "marketCap": "20.39M",
        "name": "P&F Industries, Inc.",
        "news": [
            {
                "anchor": "https://finance.yahoo.com/news/p-f-industries-inc-host-131500393.html",
                "date": "Mar-25-21 ",
                "source": "ACCESSWIRE",
                "text": "P&F Industries, Inc. to Host Earnings Call"
            },
            {
                "anchor": "https://finance.yahoo.com/news/p-f-industries-inc-reports-120000239.html",
                "date": "Mar-25-21 ",
                "source": "PR Newswire",
                "text": "P&F Industries, Inc. Reports Results For The Year Ended December 31, 2020"
            },
            {
                "anchor": "https://finance.yahoo.com/news/p-f-industries-inc-host-141500706.html",
                "date": "Nov-12-20 ",
                "source": "ACCESSWIRE",
                "text": "P&F Industries, Inc. to Host Earnings Call"
            },
            {
                "anchor": "https://finance.yahoo.com/news/p-f-industries-inc-reports-130000205.html",
                "date": "Nov-12-20 ",
                "source": "PR Newswire",
                "text": "P&F Industries, Inc. Reports Results For The Three And Nine-Month Periods Ended September 30, 2020"
            },
            {
                "anchor": "https://finance.yahoo.com/news/p-f-industries-inc-reports-120000877.html",
                "date": "Aug-11-20 ",
                "source": "PR Newswire",
                "text": "P&F Industries, Inc. Reports Results For The Three And Six-Month Periods Ended June 30, 2020"
            },
            {
                "anchor": "https://finance.yahoo.com/news/p-f-industries-report-results-120000281.html",
                "date": "Jul-27-20 ",
                "source": "PR Newswire",
                "text": "P&F Industries To Report Results For The Three And Six-Month Periods Ended June 30, 2020"
            },
            {
                "anchor": "https://finance.yahoo.com/news/p-f-industries-inc-reports-120000506.html",
                "date": "May-18-20 ",
                "source": "PR Newswire",
                "text": "P&F Industries, Inc. Reports Results For The Three-Month Period March 31, 2020"
            },
            {
                "anchor": "https://finance.yahoo.com/news/p-f-industries-report-results-130000175.html",
                "date": "May-14-20 ",
                "source": "PR Newswire",
                "text": "P&F Industries To Report Results For The Three-Month Period Ended March 31, 2020"
            },
            {
                "anchor": "https://finance.yahoo.com/news/p-f-industries-postpones-reporting-170000456.html",
                "date": "May-11-20 ",
                "source": "PR Newswire",
                "text": "P&F Industries Postpones Reporting Results for the Three-Month Period Ended March 31, 2020"
            },
            {
                "anchor": "https://finance.yahoo.com/news/p-f-industries-inc-closes-163000142.html",
                "date": "Apr-23-20 ",
                "source": "PR Newswire",
                "text": "P&F Industries, Inc. Closes On Paycheck Protection Program Loan Under The CARES Act"
            },
            {
                "anchor": "https://finance.yahoo.com/news/p-f-industries-report-results-120000611.html",
                "date": "Apr-23-20 ",
                "source": "PR Newswire",
                "text": "P&F Industries To Report Results For The Three-Month Period Ended March 31, 2020"
            },
            {
                "anchor": "https://finance.yahoo.com/news/p-f-industries-inc-host-130000117.html",
                "date": "Mar-30-20 ",
                "source": "ACCESSWIRE",
                "text": "P&F Industries, Inc. to Host Earnings Call"
            },
            {
                "anchor": "https://finance.yahoo.com/news/p-f-industries-inc-reports-120000147.html",
                "date": "Mar-30-20 ",
                "source": "PR Newswire",
                "text": "P&F Industries, Inc. Reports Results For The Year Ended December 31, 2019"
            },
            {
                "anchor": "https://finance.yahoo.com/news/p-f-industries-announces-quarterly-140000751.html",
                "date": "Feb-12-20 ",
                "source": "PR Newswire",
                "text": "P&F Industries Announces Quarterly Dividend"
            },
            {
                "anchor": "https://finance.yahoo.com/news/p-f-industries-inc-reports-130000965.html",
                "date": "Nov-12-19 ",
                "source": "PR Newswire",
                "text": "P&F Industries, Inc. Reports Results For The Three And Nine-Month Periods Ended September 30, 2019"
            },
            {
                "anchor": "https://finance.yahoo.com/news/p-f-industries-announces-quarterly-133000154.html",
                "date": "Nov-08-19 ",
                "source": "PR Newswire",
                "text": "P&F Industries Announces Quarterly Dividend"
            },
            {
                "anchor": "https://finance.yahoo.com/news/p-f-industries-inc-acquires-184600516.html",
                "date": "Oct-25-19 ",
                "source": "PR Newswire",
                "text": "P&F Industries, Inc. Acquires Blaz-Man Gear, Inc. And Gear Products & Manufacturing, Inc."
            },
            {
                "anchor": "https://finance.yahoo.com/news/p-f-industries-report-results-120000882.html",
                "date": "Oct-21-19 ",
                "source": "PR Newswire",
                "text": "P&F Industries To Report Results For The Three And Nine-Month Periods Ended September 30, 2019"
            }
        ],
        "price": "6.60",
        "profile": "P&F Industries, Inc., through its subsidiaries, designs, imports, and sells pneumatic hand tools primarily to the retail, industrial, automotive, and aerospace markets primarily in the United States. The company offers sanders, grinders, drills, saws, and impact wrenches under the Florida Pneumatic, Universal Tool, Jiffy Air Tool, AIRCAT, and NITROCAT names, as well as under private label trade names through in-house sales personnel and manufacturers' representatives to retailers, distributors, manufacturers, and private label customers. It also designs, manufactures, and distributes heavy-duty pneumatic impact tools, grinders, air motors, hydro-pneumatic riveters, hydrostatic test plugs, impact sockets, custom gears, accessories, and various replacement parts under the ATP, Numatx, Thaxton, and Quality Gear brands directly to original equipment manufacturers, as well as through a network of specialized industrial distributors serving power generation, petrochemical, aerospace, construction, railroad, mining, ship building, and fabricated metals industries. P&F Industries, Inc. was incorporated in 1963 and is based in Melville, New York.",
        "sectorsAndCountry": "Industrials | Tools & Accessories | USA",
        "sharesOutstanding": "3.15M",
        "shortOfFloat": "0.02%",
        "sixtyDayVWAP": 7.03,
        "symbol": "PFIN",
        "url": "https://finviz.com/quote.ashx?t=PFIN"
    },
    "tenQ": {
        "filingType": "10-K",
        "iXBRL": false,
        "stats": {
            "balanceSheetHTML": "",
            "balanceSheetUrl": "https://www.sec.gov/Archives/edgar/data/75340/000110465921042284/R2.htm",
            "cash": "904.0k",
            "cashBurnMonthly": "N/A",
            "cashFlowHTML": "",
            "cashFlowUrl": "https://www.sec.gov/Archives/edgar/data/75340/000110465921042284/R6.htm",
            "cashLeft": "N/A",
            "cashUsed": "N/A",
            "currentRatio": 3.57,
            "date": "Dec. 31, 2020",
            "isNegative": false,
            "monthsOfCash": "N/A",
            "na": false,
            "netCashOperating": "3.0M",
            "quickRatio": 0.11,
            "sharesOutstanding": "",
            "totalCurrentAssets": "29.5M",
            "totalCurrentLiabilities": "8.2M"
        },
        "tenQDocument": {
            "content": "",
            "conversionPrices": null,
            "lagcT": "Liquidity and Capital Resources",
            "link": "https://www.sec.gov//Archives/edgar/data/75340/000110465921042284/tm211161d1_10k.htm",
            "liquidityAndGoingConcern": "Discussion and Analysis –  and Notes to Consolidated Financial Statements.  ITEM 3.Legal Proceedings  From time to time, the Company is subject to legal proceedings and claims in the ordinary course of business. While the results of proceedings cannot be predicted with certainty, the Company believes that the final outcome of these proceedings will not have a material adverse effect on the Company’s business, financial condition, or results of operations.  ITEM 4.Mine Safety Disclosures  None.  11"
        }
    },
    "ticker": "PFIN",
    "timelines": {
        "float": [],
        "os": [
            {
                "amount": 3181286,
                "date": "Dec. 31, 2020",
                "filingType": "10-K",
                "sourceID": "",
                "sourceLink": "https://www.sec.gov//Archives/edgar/data/75340/000110465921042284/tm211161d1_10k.htm",
                "tag": ""
            }
        ]
    }
}