{"eightKs": [{"content": "Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. On December 23, 2020, in view of the total of $2,299,186 accrued but unpaid cash compensation by China Pharma Holdings, Inc. (the “Company,” “we” or “our”) to Chairman of the Board, Chief Executive Officer and interim Chief Fiancnial Officer, Ms. Zhilin Lin over the past nine years (the “Unpaid Cash Compensation”), the Compensation Committee of the Company, authorized the issuance to Ms. Li an aggregate of 2,000,000 shares of common stock (the “Shares”) under the Company’s 2010 Long-Term Incentive Plan, as amended, to partially off set the Unpaid Cash Compensation. The Shares are vesting immediately with no restrictions. Based on the per share price of $0.43, being the average of the closing prices during the past five trading days prior to the approval rendered by the Compensation Committee, higher than the closing pri", "date": "2020-12-29", "details": "", "filingType": "8-K", "link": "https://www.sec.gov//Archives/edgar/data/1106644/000121390020045181/ea132375-8k_chinapharma.htm", "nonComplianceType": "", "nonCompliant": false, "tags": []}, {"content": "Submission of Matters to a Vote of Security Holders. On December 19, 2019, China Pharma Holdings, Inc. (the “Company”) held its annual shareholders meeting for the fiscal year ended December 31, 2018 (the “Annual Meeting”). Holders of 24,595,165 shares of the Company’s common stock were present in person or by proxy at the Annual Meeting, representing 56.44% of the total outstanding shares of common stock and therefore constituting a quorum of more than one-third of the shares outstanding and entitled to vote at the Annual Meeting as of the record date. The final voting results for the matters submitted to a vote of shareholders at the meeting are as follows. No broker non-votes were counted for the proposal. 1.A proposal to elect three independent director nominees to our Board of Directors to serve until the next annual meeting and until their successors are elected and qualified:  Director’s Name Votes For  Votes Withheld  Gene Michael Bennett  23,750,350  844,815  Yingw", "date": "2019-12-23", "details": "", "filingType": "8-K", "link": "https://www.sec.gov//Archives/edgar/data/1106644/000121390019026825/f8k121919_chinapharma.htm", "nonComplianceType": "", "nonCompliant": false, "tags": []}, {"content": "Submission of Matters to a Vote of Security Holders. On December 4, 2018, China Pharma Holdings, Inc. (the “Company”) held its annual shareholders meeting for the fiscal year ended December 31, 2017 (the “Annual Meeting”). Holders of 24,092,498 shares of the Company’s common stock were present in person or by proxy at the Annual Meeting, representing 55.28% of the total outstanding shares of common stock and therefore constituting a quorum of more than one-third of the shares outstanding and entitled to vote at the Annual Meeting as of the record date. The final voting results for the matter submitted to a vote of shareholders at the meeting are as follows. No broker non-votes were counted for the proposal. A proposal to elect five director nominees to our Board of Directors to serve until the next annual meeting (for non-executive directors) or until the annual meeting in three years (for executive directors) and until their successors are elected and qualified:  Director’", "date": "2018-12-06", "details": "", "filingType": "8-K", "link": "https://www.sec.gov//Archives/edgar/data/1106644/000121390018017006/f8k120418_chinapharmahold.htm", "nonComplianceType": "", "nonCompliant": false, "tags": []}, {"content": "Other Events.  On March 6, 2018, China Pharma Holdings, Inc. (the “Company”) received notification from the NYSE American LLC (“NYSE American”) informing the Company that it had regained compliance with NYSE American’s continued listing standards. The “below compliance\" (“.BC”) indicator has no longer been disseminated since March 7, 2018, and the Company has been removed from the list of noncompliant issuers on the NYSE American website.  1 SIGNATURES Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. Date: March 12, 2018 CHINA PHARMA HOLDINGS, INC.  By: /s/ Zhilin Li Name:  Zhilin Li  Title: President and Chief Executive Officer  2", "date": "2018-03-12", "details": "", "filingType": "8-K", "link": "https://www.sec.gov//Archives/edgar/data/1106644/000121390018002824/f8k030618_chinapharmahold.htm", "nonComplianceType": "", "nonCompliant": false, "tags": []}, {"content": "Submission   of Matters to a Vote of Security Holders. On December 14, 2017, China Pharma Holdings, Inc. (the “Company”) held its annual shareholders meeting for the fiscal year ended December 31, 2016 (the “Annual Meeting”). Holders of 25,450,180 shares of the Company’s common stock were present in person or by proxy at the Annual Meeting, representing 58.4% of the total outstanding shares of common stock and therefore constituting a quorum of more than one-third of the shares outstanding and entitled to vote at the Annual Meeting as of the record date. The final voting results for the matter submitted to a vote of shareholders at the meeting are as follows. No broker non-votes were counted for the proposal. A proposal to elect three independent director nominees to our Board of Directors to serve until the next annual meeting and until their successors are elected and qualified: Director’s Name Votes For  Votes Withheld  Gene Michael Bennett  23,802,030  1,648,150  Yingwe", "date": "2017-12-18", "details": "", "filingType": "8-K", "link": "https://www.sec.gov//Archives/edgar/data/1106644/000121390017013370/f8k121417_chinapharma.htm", "nonComplianceType": "", "nonCompliant": false, "tags": []}, {"content": "Notice of Delisting or Failure to Satisfy a Continued Listing Rule or Standard; Transfer of Listing. On September 6, 2017, China Pharma Holdings, Inc. (the “Company”) received notification (the “Deficiency Letter”) from the NYSE AMERICAN LLC (“NYSE American”) that it is not in compliance with certain NYSE American continued listing standards (the “Listing Standards”). The Deficiency Letter indicated that the Company’s securities have been selling for a low price per share for a substantial period of time and most recently the average price of the Company’s common stock had been below $0.20 on a 30-day average price as of September 5, 2017. Pursuant to Section 1003(f)(v) of the NYSE American Company Guide, the NYSE American staff determined that the Company’s continued listing is predicated on it effecting a reverse stock split of its common stock or otherwise demonstrating sustained price improvement within a reasonable period of time, which the staff determined t", "date": "2017-09-12", "details": "", "filingType": "8-K", "link": "https://www.sec.gov//Archives/edgar/data/1106644/000121390017009599/f8k090617_chinapharma.htm", "nonComplianceType": "", "nonCompliant": false, "tags": []}, {"content": "Results of Operations and Financial Condition. On March 31, 2017, the registrant issued a press release announcing (i) certain financial results for the fiscal year ended December 31, 2016; and (ii) a conference call to be held by the registrant on Friday, March 31, 2017 at 8:30 a.m. Eastern Time to discuss the results of operations for the fiscal year ended December 31, 2016. A copy of the press release is attached hereto as Exhibit 99.1. Item 9.01.Financial Statements and Exhibits.  (d)  Exhibits. The following is filed as an exhibit to this report:  Exhibit No.  Description   99.1   Press Release, dated March 31, 2017   SIGNATURES Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized. Date: March 31, 2017   CHINA PHARMA HOLDINGS, INC.  By: /s/ Zhilin Li __________________________ Name: Zhilin Li Title: President and Chief Executive Officer", "date": "2017-03-31", "details": "", "filingType": "8-K", "link": "https://www.sec.gov//Archives/edgar/data/1106644/000121390017003047/cphi8k033017.htm", "nonComplianceType": "", "nonCompliant": false, "tags": []}], "importantItems": [], "na": false, "ownership": {"calculatedFloat": 0, "date": "", "footnotes": null, "rows": null, "sharesOutstanding": 0, "source": "", "sourceType": "", "sumActual": 0, "textbookFloat": 0}, "shelfs": [{"baseType": "S-3", "effective": "2021-01-21 16:00:00", "exemptOffering": false, "expirationDate": "2024-01-21 16:00:00 +0000 UTC", "expired": false, "fileID": "333-251973", "filings": [{"AmountSold": 0, "AtmIncreased": false, "IsLatestPreliminary": false, "IsSupplement": false, "addToRemaining": false, "aggregateAmount": 50000000, "amendmentType": "", "atmRemaining": 0, "date": "2021-01-08", "documentUrl": "https://www.sec.gov/Archives/edgar/data/1106644/000121390021001190/ea132953-s3_chinapharma.htm", "error": "", "explanatoryNote": "", "fileID": "333-251973", "fileUrl": "https://www.sec.gov/cgi-bin/browse-edgar?action=getcompany&filenum=333-251973&owner=exclude&count=40", "filingType": "S-3", "float": "", "foreign": false, "hasATM": false, "hasResale": false, "hasResaleBase": false, "hasResaleSupplement": false, "hiddenATM": "", "ib6": "", "isAmendment": false, "isHybrid": false, "isIPO": false, "mvphs": "", "offeringInfo": "", "offeringType": "", "placementAgent": "", "prefundedExercise": "", "prefundedWarrants": "", "price": 0.55, "remaining": 50000000, "resaleAggregate": 0, "resaleShares": "", "sharesOffered": 0, "sharesOutstanding": "", "sharesOutstandingPrior": "", "show": true, "subjectToCompletion": false, "warrants": null}], "foreign": false, "hasATM": false, "hasHiddenATM": false, "isIPO": false, "latestFilingDate": "2021-01-08", "show": true}], "stockInfo": {"exchange": "AMEX", "float": "19.94M", "income": "-20.40M", "io": "2.90%", "marketCap": "36.60M", "name": "China Pharma Holdings, Inc.", "news": [{"anchor": "https://finance.yahoo.com/news/china-pharma-holdings-inc-reports-210000485.html", "date": "Mar-26-21 ", "source": "PR Newswire", "text": "China Pharma Holdings, Inc. Reports Fiscal Year 2020 Financial Results"}, {"anchor": "https://finance.yahoo.com/news/china-pharma-holdings-inc-reports-211000819.html", "date": "Nov-13-20 ", "source": "PR Newswire", "text": "China Pharma Holdings, Inc. Reports Third Quarter 2020 Financial Results"}, {"anchor": "https://finance.yahoo.com/news/china-pharmaceutical-holdings-co-ltd-123000633.html", "date": "Sep-21-20 ", "source": "PR Newswire", "text": "China Pharmaceutical Holdings Co., Ltd. Has Obtained Multiple Certifications for Its Masks"}, {"anchor": "https://finance.yahoo.com/news/china-pharma-holdings-inc-reports-103000894.html", "date": "Aug-14-20 ", "source": "PR Newswire", "text": "China Pharma Holdings, Inc. Reports Second Quarter 2020 Financial Results"}, {"anchor": "https://finance.yahoo.com/news/cphi-hold-second-quarter-2020-141000178.html", "date": "Aug-11-20 ", "source": "PR Newswire", "text": "CPHI to Hold Second Quarter 2020 Earnings Conference Call On Friday August 14, 2020 at 8:30 a.m. ET"}, {"anchor": "https://finance.yahoo.com/news/china-pharma-holdings-inc-reports-103000126.html", "date": "May-15-20 ", "source": "PR Newswire", "text": "China Pharma Holdings, Inc. Reports First Quarter 2020 Financial Results"}, {"anchor": "https://finance.yahoo.com/news/china-pharmaceutical-holdings-co-ltd-120000982.html", "date": "Apr-15-20 ", "source": "PR Newswire", "text": "China Pharmaceutical Holdings Co., Ltd. Added Mask Production Lines"}, {"anchor": "https://finance.yahoo.com/news/updates-china-pharma-holdings-inc-203000235.html", "date": "Apr-14-20 ", "source": "PR Newswire", "text": "Updates - China Pharma Holdings, Inc. Reports Fiscal Year 2019 Financial Results"}, {"anchor": "https://finance.yahoo.com/news/china-pharma-holdings-inc-reports-103000338.html", "date": "Mar-31-20 ", "source": "PR Newswire", "text": "China Pharma Holdings, Inc. Reports Fiscal Year 2019 Financial Results"}, {"anchor": "https://finance.yahoo.com/news/cphi-hold-fiscal-2019-earnings-123000606.html", "date": "Mar-13-20 ", "source": "PR Newswire", "text": "CPHI to Hold Fiscal Year 2019 Earnings Conference Call On Tuesday March 31, 2020 at 8:30 a.m. ET"}, {"anchor": "https://finance.yahoo.com/news/china-pharmaceutical-holdings-co-ltd-120000981.html", "date": "Mar-02-20 ", "source": "PR Newswire", "text": "China Pharmaceutical Holdings Co., Ltd. Launched A New Product"}, {"anchor": "https://finance.yahoo.com/news/china-pharma-holdings-inc-reports-130000823.html", "date": "Nov-15-19 ", "source": "PR Newswire", "text": "China Pharma Holdings, Inc. Reports Third Quarter 2019 Financial Results"}, {"anchor": "https://finance.yahoo.com/news/china-pharma-holdings-inc-entered-120000119.html", "date": "Sep-11-19 ", "source": "PR Newswire", "text": "China Pharma Holdings, Inc. Has Entered into A Memorandum of Understanding With World Health Advanced Technologies, Ltd."}, {"anchor": "https://finance.yahoo.com/news/china-pharma-holdings-inc-reports-103000031.html", "date": "Aug-15-19 ", "source": "PR Newswire", "text": "China Pharma Holdings, Inc. Reports Second Quarter 2019 Financial Results"}, {"anchor": "https://finance.yahoo.com/news/china-pharma-holdings-inc-reports-100000216.html", "date": "May-15-19 ", "source": "PR Newswire", "text": "China Pharma Holdings, Inc. Reports First Quarter 2019 Financial Results"}, {"anchor": "https://finance.yahoo.com/news/cphi-hold-first-quarter-2019-120000978.html", "date": "May-07-19 ", "source": "PR Newswire", "text": "CPHI to Hold First Quarter 2019 Earnings Conference Call On Wednesday, May 15, 2019 at 8:30 a.m. ET"}, {"anchor": "https://finance.yahoo.com/news/china-pharma-holdings-inc-reports-100000705.html", "date": "Mar-29-19 ", "source": "PR Newswire", "text": "China Pharma Holdings, Inc. Reports Fiscal Year 2018 Financial Results"}, {"anchor": "https://finance.yahoo.com/news/investor-expectations-drive-momentum-within-135500169.html", "date": "Nov-23-18 ", "source": "GlobeNewswire", "text": "Investor Expectations to Drive Momentum within Cel-Sci, DGSE Companies, Veracyte, China Pharma, Barnwell Industries, and Silvercrest Asset Management Group  Discovering Underlying Factors of Influence"}, {"anchor": "https://finance.yahoo.com/news/china-pharma-holdings-inc-reports-110000349.html", "date": "Nov-15-18 ", "source": "PR Newswire", "text": "China Pharma Holdings, Inc. Reports Third Quarter 2018 Financial Results"}, {"anchor": "https://finance.yahoo.com/news/china-pharma-holdings-inc-launched-130000919.html", "date": "Nov-13-18 ", "source": "PR Newswire", "text": "China Pharma Holdings, Inc. Launched Health Product Noni Enzyme ARARATO®"}], "price": "0.83", "profile": "China Pharma Holdings, Inc. develops, manufactures, and markets generic and branded pharmaceutical, and biochemical products primarily to hospitals and private retailers in the People's Republic of China. The company offers products in the form of dry powder injectables, liquid injectables, tablets, capsules, and cephalosporin oral solutions. Its products include Cerebroprotein Hydroloysate injection to treat memory decline and attention deficit; Gastrodin injection for tiredness, loss of concentration, poor sleep, and traumatic syndromes of the brain; Propylgallate and Ozagrel Sodium to treat cerebral thrombosis, coronary heart disease, and after surgery complications; Alginic Sodium Diester injection for ischemic heart, cerebrovascular, and high lipoprotein blood diseases; Bumetanide to treat edema diseases; and Candesartan for hypertension. It also provides Roxithromycin dispersible tablets for pharyngitis and tonsillitis; Cefaclor dispersible tablets for tympanitis, lower respiratory tract infection, urinary tract infections, and skin/skin tissue infection; Cefalexin capsules for acute tonsillitis; Anhydroandrographolide for ischemic heart, cerebrovascular, and high lipoprotein blood diseases; Clarithromycin granules and capsules; and Naproxen Sodium and PseudophedrineHydrochlorida sustained release tablets. In addition, the company offers Hepatocyte growth-promoting factor, Tiopronin, Compound Ammonium Glycyrrhetate S, and Omeparzole for the treatment of digestive diseases. Further, it provides Vitamin B6 injection; and Granisetron Hydrochloride injection to treat nausea and vomiting caused by radiotherapy and chemotherapy during the treatment of malignant tumors. The company offers its products through distributors, as well as through its network of 16 sales offices and approximately 1,000 sales representatives. China Pharma Holdings, Inc. is headquartered in Haikou, the People's Republic of China.", "sectorsAndCountry": "Healthcare | Drug Manufacturers - Specialty & Generic | China", "sharesOutstanding": "43.58M", "shortOfFloat": "0.67%", "sixtyDayVWAP": 1.28, "symbol": "CPHI", "url": "https://finviz.com/quote.ashx?t=CPHI"}, "tenQ": {"filingType": "10-K", "iXBRL": false, "stats": {"balanceSheetHTML": "", "balanceSheetUrl": "https://www.sec.gov/Archives/edgar/data/1106644/000121390021017981/R2.htm", "cash": "957.6k", "cashBurnMonthly": "N/A", "cashFlowHTML": "", "cashFlowUrl": "", "cashLeft": "N/A", "cashUsed": "N/A", "currentRatio": 0.47, "date": "Dec. 31, 2020", "isNegative": false, "monthsOfCash": "N/A", "na": false, "netCashOperating": "0", "quickRatio": 0.08, "sharesOutstanding": "", "totalCurrentAssets": "5.3M", "totalCurrentLiabilities": "11.4M"}, "tenQDocument": {"content": "", "conversionPrices": null, "lagcT": "Liquidity and Capital Resources", "link": "https://www.sec.gov//Archives/edgar/data/1106644/000121390021017981/f10k2020_chinapharma.htm", "liquidityAndGoingConcern": "Our principal source of liquidity is cash generated from operations and bank lines of credit. In addition to the aggregated advance of $724,963 from our CEO in 2019, we received some temporary advances from and made several repayments to her in 2020. As of December 31, 2020, the aggregated advance from our CEO was $740,316 for use in operations. Our cash and cash equivalents were $1.0 million, representing 4.5% of our total assets, as of December 31, 2020, as compared to $1.1 million, representing 4.8% of our total assets as of December 31, 2019. All of the $1.0 million of cash and cash equivalents as of December 31, 2020 are considered to be reinvested indefinitely in the Company’s Chinese subsidiary, Helpson and is not expected to be available for payment of dividends or for other payments to its parent company or to its shareholders. In April 2020, the Company obtained a line of credit from Postal Savings Bank of China for an aggregate amount of RMB 10,000,000 (approximately $1.4 million), of which RMB 8,000,000 (approximately $1.2 million) have been advanced at December 31, 2020. The loan bears interest at a rate of 4.25% per annum. Advances on the line of credit shall be repaid in installments semi-annually for two years from the date of the advance; the first repayment of RMB 500,000 (approximately $0.07 million) was made on October 20, 2020, and the second repayment of RMB 300,000 (approximately $0.06 million) was made in January 2021. The Company has an additional RMB 2,000,000 (approximately $0.3 million) available under the line, subject to a risk review and approval by the third party guarantee company. On June 30, 2020 the Company obtained a line of credit with Bank of Communications for an aggregate amount of RMB 8,500,000 (approximately $1.3 million), all of which have been advanced. The loan bears interest at a rate of 4.05% per annum. In addition, we... (See filing for more info)"}}, "ticker": "CPHI", "timelines": {"float": [], "os": [{"amount": 45579557, "date": "Dec. 31, 2020", "filingType": "10-K", "sourceID": "", "sourceLink": "https://www.sec.gov//Archives/edgar/data/1106644/000121390021017981/f10k2020_chinapharma.htm", "tag": ""}]}}