{"eightKs": [{"content": "Notice of Delisting or Failure to Satisfy a Continued Listing Rule or Standard; Transfer of Listing On March 11, 2021, SeaChange International, Inc. (the “Company”) received a deficiency letter from NASDAQ informing the Company that it was no longer in compliance with NASDAQ Listing Rule 5605(c)(2)(A) requiring at least three (3) independent directors on the Company’s Audit Committee due to the resignation of Mr. Andrew Sriubas from the Company’s board of directors on February 10, 2021. The notification has no immediate effect on the listing of the Company’s common stock on the NASDAQ Capital Market. In accordance with NASDAQ Listing Rule 5605(c)(4)(B), the Company has an automatic cure period in order to regain compliance with NASDAQ Listing Rule 5605 as follows:  •  Until the earlier of the Company’s next annual shareholders’ meeting or February 10, 2022; or  •  If the next annual shareholders’ meeting is held before August 9, 2021, then the Company must evidence ", "date": "2021-03-17", "details": "", "filingType": "8-K", "link": "https://www.sec.gov//Archives/edgar/data/1019671/000119312521084208/d153686d8k.htm", "nonComplianceType": "", "nonCompliant": false, "tags": []}, {"content": "Termination of a Material Definitive Agreement. On March 21, 2021, SeaChange International, Inc. (“SeaChange” or the “Company”) entered into a Sublease Termination Agreement (the “Termination Agreement”) with respect to its Sublease Agreement, dated December 19, 2019, with Saucony, Inc. for the lease of its current headquarters located at 500 Totten Pond Road, Waltham, Massachusetts. The Termination Agreement provides for the early termination of such sublease effective March 21, 2021, and otherwise contains customary terms for the early termination of a corporate lease. Prior to the execution of the Termination Agreement, the sublease had been scheduled to expire in February 2025. In connection with the early termination of the sublease, the Company will pay the sublandlord a termination payment of approximately $429,900 against an obligation of approximately $2.8 million. As a result of the Termination Agreement, the Company expects a savings of approximately $2.4 million", "date": "2021-03-25", "details": "", "filingType": "8-K", "link": "https://www.sec.gov//Archives/edgar/data/1019671/000119312521094498/d124522d8k.htm", "nonComplianceType": "", "nonCompliant": false, "tags": []}, {"content": "Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. (b) On January 14, 2021, Chad Hassler resigned as the Chief Commercial Officer of SeaChange International, Inc. (the “Company” or “SeaChange”), effective January 15, 2021. Mr. Hassler’s departure is not a result of any disagreement with the Company relating to the Company’s operations, policies or practices. SIGNATURE Pursuant to the requirements of the Securities Exchange Act of 1934, the registrant has duly caused this report to be signed on its behalf by the undersigned hereunto duly authorized.  SEACHANGE INTERNATIONAL, INC. By:  /s/ Michael D. Prinn Michael D. Prinn Senior Vice President, Chief Financial Officer & Treasurer Dated: January 19, 2021", "date": "2021-01-19", "details": "", "filingType": "8-K", "link": "https://www.sec.gov//Archives/edgar/data/1019671/000119312521011445/d98153d8k.htm", "nonComplianceType": "", "nonCompliant": false, "tags": []}, {"content": "Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. (b) On February 10, 2021, Andrew Sriubas resigned as a member of the Board of Directors (the “Board”) and the Audit, Compensation and Corporate Governance and Nominating Committees of SeaChange International, Inc. (the “Company” or “SeaChange”), effective immediately. Mr. Sriubas’ departure is not a result of any disagreement with the Company relating to the Company’s operations, policies or practices.  (d) Upon recommendation of the Corporate Governance and Nominating Committee, on February 10, 2021, the Board appointed Mr. Matthew Stecker as a Class I director of SeaChange with a term to expire at the 2021 Annual Meeting. Mr. Stecker, 52, has served as a member of the board of directors of Evolving Systems (NASDAQ:EVOL), a leader in real-time digital engagement solutions and services, since March 2016, and was named Chairma", "date": "2021-02-11", "details": "", "filingType": "8-K", "link": "https://www.sec.gov//Archives/edgar/data/1019671/000119312521037411/d91394d8k.htm", "nonComplianceType": "", "nonCompliant": false, "tags": []}, {"content": "Departure of Directors or Certain Officers; Election of Directors; Appointment of Certain Officers; Compensatory Arrangements of Certain Officers. Chief Executive Officer Transition and Principal Executive Officer Appointment (b) On January 8, 2021, Yossi Aloni resigned as the Chief Executive Officer, President and as a member of the Board of Directors (the “Board”) of SeaChange International, Inc. (the “Company” or “SeaChange”), effective immediately (the “Resignation”). Mr. Aloni’s departure is not a result of any disagreement with the Company relating to the Company’s operations, policies or practices.  (c) Following the Resignation, on January 12, 2021, the Board appointed Robert Pons as Executive Chair, effective January 8, 2021. In connection with that appointment, Mr. Pons will continue his duties as Chairman of the Board and assume the duties of the Company’s Principal Executive Officer. Mr. Pons did not enter into any plan, contract or arrangement in conn", "date": "2021-01-13", "details": "", "filingType": "8-K", "link": "https://www.sec.gov//Archives/edgar/data/1019671/000119312521007770/d84678d8k.htm", "nonComplianceType": "", "nonCompliant": false, "tags": []}, {"content": "Results of Operations and Financial Condition. Attached as Exhibit 99.1 hereto, and incorporated herein by reference, is a copy of the press release issued by SeaChange International, Inc. (“SeaChange”) dated December 10, 2020, reporting SeaChange’s preliminary financial results for the quarter ended October 31, 2020. The information contained in this Item 2.02 and Exhibit 99.1 attached hereto and incorporated herein by reference is being furnished and shall not be deemed “filed” for purposes of Section 18 of the Securities Exchange Act of 1934, as amended, or otherwise subject to the liabilities of that Section or Sections 11 and 12(a)(2) of the Securities Act of 1933, as amended. This information shall not be incorporated by reference into any filing with the U.S. Securities and Exchange Commission made by SeaChange, whether made before or after the date hereof, regardless of any general incorporation language in such filings. Item 9.01. Financial Statements and Exhibits. (", "date": "2020-12-10", "details": "", "filingType": "8-K", "link": "https://www.sec.gov//Archives/edgar/data/1019671/000156459020056728/seac-8k_20201210.htm", "nonComplianceType": "", "nonCompliant": false, "tags": []}, {"content": "Notice of Delisting or Failure to Satisfy a Continued Listing Rule or Standard; Transfer of Listing. On October 30, 2020, SeaChange International, Inc. (the “Company”) received a deficiency letter from the Nasdaq Listing Qualifications Department (the “Staff”) of The Nasdaq Stock Market LLC (“Nasdaq”) notifying the Company that, for the last 30 consecutive business days, the closing bid price for the Company’s common stock has been below the minimum $1.00 per share required for continued listing on The Nasdaq Global Select Market pursuant to Nasdaq Listing Rule 5450(a)(1) (the “Minimum Bid Price Requirement”). The Nasdaq deficiency letter has no immediate effect on the listing of the Company’s common stock, and its common stock will continue to trade on The Nasdaq Global Select Market under the symbol “SEAC” at this time. In accordance with Nasdaq Listing Rule 5810(c)(3)(A), the Company has been given 180 calendar days, or until April 27, 2021, to regain complia", "date": "2020-11-05", "details": "", "filingType": "8-K", "link": "https://www.sec.gov//Archives/edgar/data/1019671/000119312520286969/d36380d8k.htm", "nonComplianceType": "Minimum Bid Price Requirement", "nonCompliant": true, "tags": []}], "importantItems": [{"date": "2020-11-05", "details": "", "kind": "", "nonCompliant": true, "sourceLink": "https://www.sec.gov//Archives/edgar/data/1019671/000119312520286969/d36380d8k.htm", "sourceType": "8-K", "tag": "Minimum Bid Price Requirement"}], "na": false, "ownership": {"calculatedFloat": 0, "date": "", "footnotes": null, "rows": null, "sharesOutstanding": 0, "source": "", "sourceType": "", "sumActual": 0, "textbookFloat": 0}, "shelfs": [{"baseType": "S-3", "effective": "2021-03-16 16:00:00", "exemptOffering": false, "expirationDate": "2024-03-15 16:00:00 +0000 UTC", "expired": false, "fileID": "333-252777", "filings": [{"AmountSold": 0, "AtmIncreased": false, "IsLatestPreliminary": false, "IsSupplement": false, "addToRemaining": false, "aggregateAmount": 200000000, "amendmentType": "", "atmRemaining": 0, "date": "2021-02-05", "documentUrl": "https://www.sec.gov/Archives/edgar/data/1019671/000119312521030583/d121633ds3.htm", "error": "", "explanatoryNote": "", "fileID": "333-252777", "fileUrl": "https://www.sec.gov/cgi-bin/browse-edgar?action=getcompany&filenum=333-252777&owner=exclude&count=40", "filingType": "S-3", "float": "", "foreign": false, "hasATM": false, "hasResale": false, "hasResaleBase": false, "hasResaleSupplement": false, "hiddenATM": "", "ib6": "", "isAmendment": false, "isHybrid": false, "isIPO": false, "mvphs": "", "offeringInfo": "", "offeringType": "", "placementAgent": "", "prefundedExercise": "", "prefundedWarrants": "", "price": 1.19, "remaining": 200000000, "resaleAggregate": 0, "resaleShares": "", "sharesOffered": 0, "sharesOutstanding": "", "sharesOutstandingPrior": "", "show": true, "subjectToCompletion": false, "warrants": null}], "foreign": false, "hasATM": false, "hasHiddenATM": false, "isIPO": false, "latestFilingDate": "2021-02-05", "show": true}], "stockInfo": {"exchange": "NASDAQ", "float": "27.98M", "income": "-17.40M", "io": "23.40%", "marketCap": "39.80M", "name": "SeaChange International, Inc.", "news": [{"anchor": "https://finance.yahoo.com/news/seachange-international-strategic-roadmap-operational-113000121.html", "date": "Mar-15-21 ", "source": "GlobeNewswire", "text": "SeaChange Internationals Strategic Roadmap and Operational Progress Strengthens Companys Position for Fiscal 2022"}, {"anchor": "https://finance.yahoo.com/news/sea-limited-report-fourth-quarter-080000535.html", "date": "Feb-16-21 ", "source": "Business Wire", "text": "Sea Limited to Report Fourth Quarter and Full Year 2020 Results"}, {"anchor": "https://finance.yahoo.com/news/seachange-international-appoints-veteran-technology-130000472.html", "date": "Feb-11-21 ", "source": "GlobeNewswire", "text": "SeaChange International Appoints Veteran Technology Executive Matthew Stecker to Board of Directors"}, {"anchor": "https://finance.yahoo.com/news/seachange-international-appoints-chairman-robert-130000880.html", "date": "Jan-13-21 ", "source": "GlobeNewswire", "text": "SeaChange International Appoints Chairman Robert Pons as Executive Chairman; Board of Directors Initiates Search for New CEO to Lead Company's Next Phase of Growth"}, {"anchor": "https://finance.yahoo.com/news/seachange-framework-solution-enabling-content-130000529.html", "date": "Dec-21-20 ", "source": "GlobeNewswire", "text": "The SeaChange Framework Solution Enabling Content Owners & Providers a Complete OTT Streaming Platform with New Advertising and Subscription Revenue Streams"}, {"anchor": "https://finance.yahoo.com/news/seachange-international-reports-fiscal-third-210500398.html", "date": "Dec-10-20 ", "source": "GlobeNewswire", "text": "SeaChange International Reports Fiscal Third Quarter 2021 Financial and Operational Results; Company Sees Strong Demand from Content Owners for New Video Apps Platform"}, {"anchor": "https://finance.yahoo.com/news/seachange-international-inc-host-earnings-201500430.html", "date": "Dec-10-20 ", "source": "ACCESSWIRE", "text": "SeaChange International, Inc. to Host Earnings Call"}, {"anchor": "https://finance.yahoo.com/news/seachange-international-sets-third-quarter-210500876.html", "date": "Dec-01-20 ", "source": "GlobeNewswire", "text": "SeaChange International Sets Third Quarter Fiscal 2021 Conference Call for Thursday, December 10 at 5:00 p.m. ET"}, {"anchor": "https://finance.yahoo.com/news/seachange-international-reports-fiscal-second-200500329.html", "date": "Sep-08-20 ", "source": "ACCESSWIRE", "text": "SeaChange International Reports Fiscal Second Quarter 2021 Financial Results"}, {"anchor": "https://finance.yahoo.com/news/seachange-corporation-seachange-international-sets-120000109.html", "date": "Aug-25-20 ", "source": "ACCESSWIRE", "text": "SeaChange Corporation: SeaChange International Sets Second Quarter Fiscal 2021 Conference Call for Tuesday, September 8 at 5:00 p.m. ET"}, {"anchor": "https://finance.yahoo.com/news/seachange-leadership-extends-salary-reduction-121500053.html", "date": "Jul-06-20 ", "source": "ACCESSWIRE", "text": "SeaChange Leadership Extends Salary Reduction Plan"}, {"anchor": "https://finance.yahoo.com/news/seachange-joins-russell-3000-r-130000996.html", "date": "Jun-29-20 ", "source": "ACCESSWIRE", "text": "SeaChange Joins Russell 3000(R) Index"}, {"anchor": "https://finance.yahoo.com/news/seachange-international-reports-fiscal-first-200500422.html", "date": "Jun-11-20 ", "source": "ACCESSWIRE", "text": "SeaChange International Reports Fiscal First Quarter 2021 Financial Results"}, {"anchor": "https://finance.yahoo.com/news/seachange-international-inc-host-earnings-190000589.html", "date": "Jun-11-20 ", "source": "ACCESSWIRE", "text": "SeaChange International, Inc. to Host Earnings Call"}, {"anchor": "https://finance.yahoo.com/news/seachange-international-sets-first-quarter-120500649.html", "date": "Jun-01-20 ", "source": "ACCESSWIRE", "text": "SeaChange International Sets First Quarter 2021 Conference Call for Thursday, June 11 at 5:00 p.m. ET"}, {"anchor": "https://finance.yahoo.com/news/seachange-drive-tv-provider-revenues-120500524.html", "date": "May-27-20 ", "source": "ACCESSWIRE", "text": "SeaChange to Drive TV Provider Revenues and User Engagement with Amazon Web Services"}, {"anchor": "https://finance.yahoo.com/news/seachange-international-issues-business-response-204500206.html", "date": "May-21-20 ", "source": "ACCESSWIRE", "text": "SeaChange International Issues Business Update in Response to Global Impact of COVID-19"}, {"anchor": "https://finance.yahoo.com/news/zagg-announces-appointment-two-board-214238522.html", "date": "Apr-15-20 ", "source": "GlobeNewswire", "text": "ZAGG Announces Appointment of Two New Board Members; COVID-19 Response"}], "price": "1.03", "profile": "SeaChange International, Inc. provides multiscreen, advertising, and premium over the top (OTT) video products and services that facilitate the aggregation, licensing, management, and distribution of video and television advertising content worldwide. It offers video products, including SeaChange Adrenalin, a multiscreen video back office platform that enables service providers to manage, monetize, and deliver a seamless viewing experience across televisions, personal computers (PCs), tablets, smartphones, and other IP-enabled devices; and SeaChange AssetFlow, a content management solution, which is used to receive, manage, and publish content for viewing on televisions, tablets, PCs, and other consumer devices. The company also provides advertising products, such as SeaChange Infusion, an advertising platform to maximize advertising revenue across multiscreen, broadcast, on-demand, and OTT viewing. In addition, it offers SeaChange NitroX, an user experience product that empower service providers and content owners to optimize live and on-demand video consumption on multiscreen and OTT services. Further, the company provides professional, and maintenance and support services, as well as managed services. It sells and markets its products and services through a direct sales organization, and sales representatives and partners, as well as to systems integrators and value-added resellers. The company serves cable system, telecommunications companies, and satellite operators, as well as media companies. SeaChange International, Inc. was founded in 1993 and is headquartered in Acton, Massachusetts.", "sectorsAndCountry": "Technology | Software - Application | USA", "sharesOutstanding": "37.56M", "shortOfFloat": "2.11%", "sixtyDayVWAP": 1.6, "symbol": "SEAC", "url": "https://finviz.com/quote.ashx?t=SEAC"}, "tenQ": {"filingType": "10-Q", "iXBRL": false, "stats": {"balanceSheetHTML": "", "balanceSheetUrl": "https://www.sec.gov/Archives/edgar/data/1019671/000156459020056748/R2.htm", "cash": "5.1M", "cashBurnMonthly": "1.0M", "cashFlowHTML": "", "cashFlowUrl": "https://www.sec.gov/Archives/edgar/data/1019671/000156459020056748/R6.htm", "cashLeft": "0", "cashUsed": "5.1M", "currentRatio": 2.3, "date": "Oct. 31, 2020", "isNegative": true, "monthsOfCash": "0.000000", "na": false, "netCashOperating": "-9.3M", "quickRatio": 0.43, "sharesOutstanding": "", "totalCurrentAssets": "27.6M", "totalCurrentLiabilities": "12.0M"}, "tenQDocument": {"content": "", "conversionPrices": null, "lagcT": "Liquidity", "link": "https://www.sec.gov//Archives/edgar/data/1019671/000156459020056748/seac-10q_20201031.htm", "liquidityAndGoingConcern": "We continue to realize the savings related to our restructuring activities. In fiscal 2020, we continued to streamline our operations and closed our service organizations in Ireland and the Netherlands. These measures are important steps in restoring us to profitability and positive cash flow. We believe that existing cash and investments and cash expected to be provided by future operating results are adequate to satisfy our working capital, capital expenditure requirements and other contractual obligations for at least the next 12 months. If our expectations are incorrect, we may need to raise additional funds to fund our operations or take advantage of unanticipated strategic opportunities in order to strengthen our financial position. In the future, we may enter into other arrangements for potential investments in, or acquisitions of, complementary businesses, services or technologies, which could require us to seek additional equity or debt financing. If adequate funds are not available or are not available on acceptable terms, we may not be able to take advantage of market opportunities, to develop new products or to otherwise respond to competitive pressures. Impact of COVID-19 Pandemic In the first quarter of fiscal 2021, concerns related to the spread of COVID-19 began to create global business disruptions as well as disruptions in our operations and to create potential negative impacts on our revenues and other financial results. COVID-19 was declared a pandemic by the World Health Organization on March 11, 2020. The extent to which COVID-19 will impact our financial condition or results of operations is currently uncertain and depends on factors including the impact on our customers, partners, and vendors and on the operation of the global markets in general. Due to our business model, the effect of COVID-19 on our results of operations may also not be full... (See filing for more info)"}}, "ticker": "SEAC", "timelines": {"float": [], "os": [{"amount": 37556067, "date": "Oct. 31, 2020", "filingType": "10-Q", "sourceID": "", "sourceLink": "https://www.sec.gov//Archives/edgar/data/1019671/000156459020056748/seac-10q_20201031.htm", "tag": ""}]}}